---
kind: method
id: M:Autodesk.Revit.DB.TableSectionData.GetCellCombinedParameters(System.Int32)
source: html/bd63357d-e048-fcfe-8128-53e89c880836.htm
---
# Autodesk.Revit.DB.TableSectionData.GetCellCombinedParameters Method

Returns an array of combined parameter data for the specified column

## Syntax (C#)
```csharp
public IList<TableCellCombinedParameterData> GetCellCombinedParameters(
	int nCol
)
```

## Parameters
- **nCol** (`System.Int32`)

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentException** - The given column number nCol is invalid.